INSERT INTO students (name, kana_name, nick_name, email, area, age, sex)
VALUES ('山田太郎', 'ヤマダタロウ', 'タロ', 'taro@example.com', '東京', 25, '男性'),
       ('鈴木一郎', 'スズキイチロウ', 'イチ', 'ichiro@example.com', '大阪', 30, '男性'),
       ('田中花子', 'タナカハナコ', 'ハナ', 'hana@example.com', '北海道', 22, '女性'),
       ('佐藤良子', 'サトウリョウコ', 'リョウ', 'ryoko@example.com', '福岡', 28, '女性'),
       ('伊藤遥', 'イトウハルカ', 'ハル', 'haruka@example.com', '愛知', 35, 'その他'),
       ('加藤弥生', 'ヤヨイカトウ', 'ヤヨイ', 'yayoi@example.com', '埼玉', 39, '女性'),
       ('和田真也', 'ワダシンヤ', 'シンヤ', 'shinya@example.com', '鹿児島', 53, '男性'),
       ('江藤由紀子', 'エトウユキコ', 'ユキコ', 'yukiko@example.com', '奈良', 46, '女性'),
       ('江藤由紀子', 'エトウユキコ', 'ユキコ', 'yukiko@example.com', '奈良', 46, '女性'),
       ('高橋健太', 'タカハシケンタ', 'ケンタ', 'kenta@example.com', '神奈川', 35, '男性');

INSERT INTO students_courses (id, student_id, course_name, course_start_at, course_end_at)
VALUES (101, 1, 'Web開発コース', '2025-02-01 09:00:00', '2025-04-30 15:00:00'),
       (102, 1, 'データベース設計コース', '2025-03-01 10:00:00', '2025-05-31 17:00:00'),
       (103, 2, 'データベース設計コース', '2024-10-15 13:00:00', '2024-12-31 21:00:00'),
       (104, 3, 'Javaコース', '2024-07-10 09:00:00', '2025-03-10 18:00:00'),
       (105, 3, 'AI・機械学習コース', '2024-08-01 09:00:00', '2025-05-20 18:00:00'),
       (107, 3, 'ネットワークコース', '2024-12-01 09:00:00', '2025-08-31 18:00:00'),
       (108, 4, 'Javaコース', '2024-12-01 13:00:00', '2025-10-31 19:00:00'),
       (109, 4, 'AI・機械学習コース', '2025-01-05 13:00:00', '2025-05-31 16:00:00'),
       (110, 5, 'ネットワークコース', '2024-09-01 10:00:00', '2025-03-01 13:00:00'),
       (113, 15, 'Web開発コース', '2025-08-25 16:16:52', '2026-08-25 16:16:52');

DELETE FROM course_application_status;
INSERT INTO course_application_status (student_course_id, application_status, last_updated_by, notes)
VALUES
    (101, '仮申込', 'admin', '初回問い合わせあり'),
    (102, '本申込', 'admin', '本人確認済み'),
    (103, '受講中', 'system', '出席率95%'),
    (104, '仮申込', 'admin', '申込書未提出'),
    (105, '受講終了', 'system', '2025年3月に修了'),
    (107, '仮申込', 'admin', '体験参加後キャンセル検討中'),
    (108, '本申込', 'staff01', '本人確認済み・教材発送済み'),
    (109, '受講中', 'system', '課題提出率80%'),
    (110, '仮申込', 'staff02', 'オンライン説明会参加済み'),
    (113, '本申込', 'staff01', '本人確認済み');
