INSERT INTO students (name, kana_name, nickname, email, area, age, sex)
VALUES ('山田太郎', 'ヤマダタロウ', 'タロ', 'taro@example.com', '東京', 25, '男性'),
       ('鈴木一郎', 'スズキイチロウ', 'イチ', 'ichiro@example.com', '大阪', 30, '男性'),
       ('田中花子', 'タナカハナコ', 'ハナ', 'hana@example.com', '北海道', 22, '女性'),
       ('佐藤良子', 'サトウリョウコ', 'リョウ', 'ryoko@example.com', '福岡', 28, '女性'),
       ('伊藤遥', 'イトウハルカ', 'ハル', 'haruka@example.com', '愛知', 35, 'その他');

INSERT INTO students_courses (student_id, course_name, course_start_at, course_end_at)
VALUES (1, 'Web開発コース', '2025-02-01 09:00:00', '2025-04-30 15:00:00'),
       (1, 'データベース設計コース', '2025-03-01 10:00:00', '2025-05-31 17:00:00'),
       (2, 'データベース設計コース', '2024-10-15 13:00:00', '2024-12-31 21:00:00'),
       (3, 'Javaコース', '2024-07-10 09:00:00', '2025-03-10 18:00:00'),
       (3, 'AI・機械学習コース', '2024-08-01 09:00:00', '2025-05-20 18:00:00'),
       (3, 'ネットワークコース', '2024-12-01 09:00:00', '2025-08-31 18:00:00'),
       (4, 'Javaコース', '2024-12-01 13:00:00', '2025-10-31 19:00:00'),
       (4, 'AI・機械学習コース', '2025-01-05 13:00:00', '2025-05-31 16:00:00'),
       (5, 'ネットワークコース', '2024-09-01 10:00:00', '2025-03-01 13:00:00');